Repository: CherokeeLanguage/CherokeeLessons.com
Catalog: content/content/2023-06-29_cherokee-cat-computer-aided-translation-translation-memory-and-glossary-files/tm/ced.en.utf8.tmx
Source language: en
Languages: chr

source: That cat is always sleeping on a chair.
chr: ᏂᎪᎯᎸ ᎦᏍᎩᎸ ᎦᏟᎰ Ꮎ ᏪᏌ.

source: Water is dripping from the wet cloth hanging on a line.
chr: ᎠᎹ ᎦᏍᏆᎣᎢᎭ Ꮎ ᎦᏚᎵᏓ ᎠᎿᏬ ᏥᎦᏓ ᎠᏏᎳᏛᎢ.

source: He became humpbacked because he wouldn't sit up straight.
chr: ᎦᏥᏃᏍᏓ ᎾᎵᏍᏛᏡᏍᎬᎾ ᎨᏒ ᎢᏳᏍᏗ ᎦᏐᏆᏘ ᏄᎵᏍᏔᏅᎢ.

source: The man's back hurts.
chr: Ꮎ ᎠᏍᎦᏯ ᎦᏐᎯ ᎤᏪᏍᏓᏁᎭ.

source: When the dog heard someone whistling, he took off running.
chr: ᎩᎶ ᎦᏒᏂᎬ ᎤᏛᎦᎾ, ᎩᏟ ᎤᏓᎾᏩᏍᏔᏅᎢ.

source: He's piling up rocks he picked up in the field.
chr: ᏠᎨᏏ ᏧᏭᏖᏓ ᏅᏯ ᎦᏒᏛᏍᎦ.

source: An electric light is hanging from a pole.
chr: ᎨᏛ ᎦᏔ ᎠᎾᎦᎵᏍᎩ ᎠᏨᏍᏗ.

source: He lost a button from his shirt.
chr: ᎦᏘᏗ ᎤᏲᎱᏏ ᎤᎿᏬᎩᎢ.

source: The cook is looking for a cooking pan.
chr: ᎦᏖᏍᏗ ᎤᏲᎭ ᏗᏓᏍᏓᏴᎲᏍᎩ.

source: He was stabbed over and over with a knife.
chr: ᎭᏰᎵᏍᏗ ᎬᏗ ᏓᏥᏘᏏᎶᎥᎢ.

source: They prohibit drinking at the stompgrounds.
chr: ᎠᏓᏴᏍᏕᏍᏗᏍᎩ ᎠᏗᏔᏍᏗ ᎤᏂᏅᏍᏙ ᎠᏘᏲᎢ.

source: There is a squirrel tail hanging on a pole.
chr: ᏌᎶᎵ ᎦᏙᎦ ᎦᏓᎠ ᎨᏛᎢ.

source: She's hanging up a picture.
chr: ᏗᏓᏟᎶᏍᏔᏅ ᎦᏛᏍᎦ.

source: He really likes to joke.
chr: ᏙᎯᏳ ᎤᎸᏉᏗ ᎤᏪᏢᏗ.

source: When he drives the cattle for a long distance he rests them a few times.
chr: ᎢᎾ ᏱᏚᎯᎴᎾ ᏩᎦ ᎢᎸᏍᎩ ᎢᏳᏩᎦᏗ ᏕᎦᏪᏐᎸᏍᏗᏍᎪᎢ.

source: If the dog has fleas, he bathes it. He baptized ten people.
chr: ᏧᎦ ᏱᎬᏩᎳ ᎩᏟ ᎦᏬᏍᎪᎢ. ᏍᎪᎯ ᎢᏯᏂᎢ ᏴᏫ ᏚᏬᎥᎢ.

source: When you're asked a question, answer.
chr: ᎪᎱᏍᏗ ᎡᏣᏛᏛᏅ, ᎭᏬᎯᎵᏴᏒᎢ.

source: Because his son is so mean, he always lectures him.
chr: ᎤᏁᎫᏨ ᎢᏳᏍᏗ ᎤᏪᏥ ᎠᏧᏣ ᏂᎪᎯᎸ ᎦᏬᏅᏗᏍᎪᎢ.

source: Don't be listening to gossip.
chr: ᏞᏍᏗ ᎦᏬᏂᎭ ᏯᏛᏓᏍᏗᎨᏍᏗ.

source: He's talking a lot, but he's not saying anything.
chr: ᏥᏈᏍᏗ ᎦᏬᏂᎭ, ᎠᏎᏅ Ꮭ ᎪᎱᏍᏗ ᏯᏗᎭ.

source: The man raises large cantaloupes.
chr: Ꮎ ᎠᏍᎪᏯ ᏧᎾᏔᎾ ᎠᏂᏫᏒᎩ ᏓᏛᎯᏍᏗᏍᎪᎢ.

source: A wasp stung him on his finger.
chr: gᎠᏰᏌᏛ ᎤᏩᏨᏴ ᎧᎾᏥᏍᏕᏥ

source: She's sewing a dress with a sewing machine.
chr: gᎦᏰᏫᏍᎩ ᎬᏗ ᎦᏰᏫᏍᎦ ᎠᏌᏃ.

source: She wants an electric sewing machine.
chr: ᎠᎾᎦᎵᏍᎩ ᎤᏂᎩᏍᏗᏍᎩ ᎦᏰᏫᏍᎩ ᎤᏚᎵᎭ.

source: If someone is a liar, they say he has a forked tongue.
chr: ᎩᎶ ᎦᏴᎪᎩ ᏱᎩ, ᏣᎶᏥᎩ ᎦᏅᏓᏓ ᎠᎾᏗᏍᎪᎢ.

source: He goes around telling lies.
chr: ᎦᏴᎪᎩ ᎧᏃᎮᏟᏙᎰᎢ.

source: Pour me a little coffee.
chr: ᎦᏲᏟ ᎧᏫ ᏍᎩᏟᏍᏓᏏ.

source: Have you already been to town?
chr: ᎦᏳᎳᏍ Ꮻ\ᏤᏙᎳ ᏗᎦᏚᎲᎢ?

source: The dog is hungry. Feed it.
chr: ᎩᏟ ᎤᏲᏏᎭ. ᎯᏰᎶᎦ.

source: The dog howls when he hears the wolves. When their team won, the ballplayers yelled.
chr: ᏩᏯ ᏱᏚᏛᎦᎾ ᎩᏟ ᎨᏢᎲᏍᎪᎢ. ᎤᎾᎵᎪᏒ ᎤᎾᏓᏠᏌ, ᎤᏁᏡᏅ ᎠᎾᎳᏍᎦᎵᏍᎩ.

source: Have you ever tried to rope a wild horse?
chr: ᏣᏁᎵᏔᏅᎢᏍ ᏍᏈᎵ ᎨᏯᏔᎯ ᎯᏴᏍᎳᏗᏍᏗᎢ?

source: I saw him walking downstream while ago.
chr: ᎨᎢ ᏗᏜ ᏩᎢᏒ ᏣᏫᏣᎪᎥ ᎪᎯᎢ.

source: She has to go to the clinic tomorrow.
chr: ᎨᏥᎪᎵᏰᏗ ᏭᏪᏍᏓᏍᏗ ᏑᎾᎴᎢ.

source: He's leading a small dog by a leash.
chr: ᎤᏍᏗ ᎩᏟ ᎨᎵᏏᏁᎭ.

source: How much are the pies?
chr: ᎯᎳ ᏣᎬᏩᎶᏗ ᏗᎨᎵᏍᏘᎩ.

source: When he digs holes in a rocky place, he uses a crowbar.
chr: ᏅᏲᎯ ᏱᏓᏍᎪᏍᎦ ᎨᏘᎶᏍᏗ ᎬᏗᏍᎪᎢ.

source: Who buys posts?
chr: ᎦᎪ ᏚᏩᏍᎪ ᏗᎨᏛᏏᏗ?

source: Set the post here in the center.
chr: ᎠᎭᏂ ᎠᏰᏟ ᎮᏛᎦ.

source: There's blood on your shirt.
chr: ᎩᎦ ᎤᏓᏅᎵᏰᎠ ᏣᏄᏮᎢ.

source: When a ball hit him on his nose, he got a nosebleed.
chr: ᏍᏆᏞᏍᏗ ᎤᏩᏂᎳ ᎧᏴᏐᎵ ᎩᎦ ᏚᏴᏍᏉᎸᎢ.

source: Red is my favorite color.
chr: ᎩᎦᎨ ᎤᎵᏑᏫᏓ ᏩᎩᎸᏉᏛᎢ.

source: There's some loose hair on your shirt.
chr: ᎩᏝ ᏄᏍᏗ ᏣᏄᏮᎢ.

source: I see a mean dog.
chr: ᎩᏟ ᎤᎾᎸᎯ ᏥᎪᏩᏘᎭ.

source: I hear a hounddog barking.
chr: ᎩᏟ ᏗᎦᎴᏅᎯᏓ ᏓᏑᏪᏍᎬ ᎦᏛᎩᎠ.

source: This is how it is written in English.
chr: ᎯᎠ ᏂᎬᎿ ᎩᎵᏏ ᎪᏪᎸᎢ.

source: Lend me a quarter.
chr: ᎩᏄᏘᏗ ᏍᎩᏙᎵᏍᏓ.

source: She's going to quit teaching next spring.
chr: ᏐᎢ ᎪᎨᏱ ᎢᏴ ᏛᏑᎵᎪᏥ ᏓᏕᏲᎲᏍᎬᎢ.

source: I can't wait till summer.
chr: ᎠᏋᏅᎦ ᎪᎩ ᎢᏳᎵᏍᏙᏗᎢ.

source: Did he take a long time building the house?
chr: ᎪᎯᏓᏍ ᎤᎯᎶᏙᎴ ᎦᎵᏦᏕ ᎠᏁᏍᎨᏍᎬᎢ?

source: He holds his son's hand when they cross the water.
chr: ᎪᎣᎯᏁᎪ ᎤᏪᏥ ᎠᏧᏣ ᎠᎹᏱ ᏱᏚᏂᏐᏣ.

source: I agree with what he says. I want you to vouch for me.
chr: ᏥᏲᎢᏴᏓᏁ ᏂᎦᏪᏍᎬᏒᎢ. ᏍᏉᎯᏴᏓᏁᏗ ᎠᏆᏚᎵᎭ.

source: He has a lot of faith.
chr: ᏥᏈᏍᏗ ᎪᎯᏴᏗ ᎤᏪᎭ.

source: Even if it's been ten years since he has seen someone, he recognizes him easily.
chr: ᎥᏍᏊ ᏍᎪᎯ ᎾᏕᏘᏯ ᎬᏩᎪᎲ ᏱᎩ ᎩᎶ, ᎠᎯᏓ ᎪᎵᎪᎢ.

source: Does he understand Cherokee?
chr: ᎪᎵᎦᏍ ᏣᎳᎩ?

source: Do you know this man?
chr: ᎯᏲᎵᎩᏍ ᎯᎠ ᎠᏍᎦᏯ?

source: Pass me some butter.
chr: ᎪᏢᏅ ᎡᏍᎩᏕᎳ

source: If he eats just a little, he gets full.
chr: ᎦᏲᏟᏊ ᏳᎵᏍᏓᏴᎾ, ᏢᏍᎪᎢ

source: What are you making?
chr: ᎦᏙ ᎤᏍᏗ ᎰᏢᏍᎦ?

source: He accidently dropped the clock from the table.
chr: ᎦᏍᎩᎸ ᏝᎲ ᏩᏣ ᎤᏬᎰᏅᏙᏔᏅᎢ

source: The window pane fell.
chr: ᏦᎳᏂ ᎦᏘᏅᏛ ᎤᏬᎰᏒᎢ.

source: They are looking for something, but I don't know what it is.
chr: ᎪᎱᏍᏗ ᎤᏂᏲ ᎠᏎᏅ Ꮭ ᏯᏆᎾᏔ ᎢᏳᏍᏗ ᎨᏒᎢ.

source: They ordered some writing tablets.
chr: ᎪᏪᎵ ᏗᎪᏪᎶᏗ ᏚᎾᏓᏅᏒᎢ.

source: Whose letter are you writing?
chr: ᎦᎪ ᎤᏁᏍᏗ ᎪᏪᎵ ᎰᏪᎵᎠ?

source: A lot of Cherokee students go to school at Greasy School.
chr: ᎤᏂᎪᏗ ᎠᏂᏣᎳᎩ ᏗᎾᏕᏠᏆᏍᎩ ᏓᎾᏕᏠᏆᏍᎪ ᎪᎢ ᏧᎾᏕᏠᏆᏍᏗ.

source: Sausage makes a lot of grease.
chr: ᏏᏆ ᎭᏫᏯ ᏥᏈᏍᏗ ᎪᎢ ᎠᏙᏢᎾᏗᏍᎪᎢ.

source: He is eating greasy meat.
chr: ᎪᎢᎭ ᎭᏫᏯ ᎠᎩᎠ.

source: Which finger do you use when you pull the trigger?
chr: ᎦᏙ ᎤᏍᏗ ᎯᏰᏌᏛ ᎲᏗᏍᎪ ᏱᏦᏣᏁᏌ?

source: He's oiling the trigger so it won't rust.
chr: ᎤᏯᏍᏜᏗᏍᏗ ᏂᎨᏒᎾ ᎤᏰᎸᏒ ᎪᏣᏁᏍᏗ ᎦᎶᏁᎠ.

source: There are twenty cigarettes in one package.
chr: ᏔᏍᎵᏍᎪᎯ ᏗᎪᎦᏍᎩ ᏕᎦᎶ ᏌᏊ ᏂᏕᎦᏇᏅᏒᎢ.

source: He smokes two packages of cegarettes in one day.
chr: ᏔᎵ ᏂᏕᎦᎳᏗᏍᏛ ᏗᎪᎦᏍᏗ ᏕᎪᎦᏍᎪᎢ ᏏᎦ.

source: Do you like winter?
chr: ᏣᎸᏉᏗᏍ ᎪᎳ?

source: The doctor has pneumonia.
chr: ᎪᎴᎯ ᎤᏢᎦ ᎦᎾᎦᏘ.

source: When I sharpened the axe with a file, it became sharp.
chr: ᎠᏥᎳ ᎤᏥᎦᏘ ᎬᏗ ᎠᎩᏢᎦᎭ ᎦᎷᏯᏍᏗ ᎪᏍᏓᏱ ᏄᎵᏍᏔᏅᎢ.

source: He was using a dull axe to chop wood.
chr: ᎪᏍᏗᏳᏟ ᎦᎷᏯᏍᏗ ᎬᏗᏍᎬ ᎠᏓ ᏓᏍᏆᎵᏍᎬᎢ.

source: They lost the ball when he batted.
chr: ᏍᏆᏞᏍᏗ ᎤᏂᏲᎱᏎᎸ ᎤᏬᏍᏛᏂᎳ.

source: How many bats did you bring?
chr: ᎯᎳ ᎢᎦ ᏗᎪᏍᏛᏂᏍᏗ ᏕᎯᏃᎦ?

source: Tell him I said hello when you seehim.
chr: ᏏᏲ ᎠᏗᎭ ᎯᏲᏎᎸ ᎯᎪᎥᎢ.

source: His leg swelled where a snake bit him.
chr: ᎢᎾᏓ ᎤᏍᎦᎵᏨ ᎦᏅᏍᎨᏂ ᎤᏬᏘᏒᎢ.

source: Let's sit by the fire.
chr: ᎪᏛ ᎾᎤ ᏕᎩᏃᏞᏍᏗ.

source: Last night l built a big fire .
chr: ᎤᏒ ᏥᎨᏒ ᎤᏔᎾ ᎠᎪᏔᏅᎢ.

source: Unhitch the horse and let him graze. He unhooked the chain when the car started. He unplugs the television when it's lightening.
chr: ᎯᏳᏓᎳᎩ ᏐᏈᎵ ᎤᏁᎳᎩ ᏩᎵᏍᏓᏴᏂᏓ. ᎤᏂᎩᏌ ᏓᏆᎴᎳ ᎤᏭᏓᎴᏒ ᎤᎾᏓᏕᏒᏓ. ᎠᏓᏴᎳᏛᏍᎩ ᎫᏓᎴᏍᎪ ᏯᎾᎦᎵᎠ.

source: He hitched up his horse at the hitching post. Did he hook up the battery?
chr: ᏐᏈᎵ ᎤᎾᏚᏓᎸᏗ ᎤᏩᏓᎸᏅ ᏐᏈᎵ ᎤᏣᎵᎢ. ᏕᎫᏓᎸᎢᎦᏍ ᎠᎾᎦᎵᏍᎩ?

source: These bottles contain milk.
chr: ᎯᎠ ᎫᎫ ᎤᏅᏗ ᏓᏟᏍᏗ.

source: Ticks are making the dog itch.
chr: ᎫᎫ ᏕᏆᏲᏕᏍᏗ ᎩᏟ.

source: Have you been to Bartlesville?
chr: ᏤᏙᎸᎢᏍ ᎫᎫ?

source: He's whittling a handle for an axe.
chr: ᎦᎷᏯᏍᏗ ᎫᎭᎵᏗ ᎠᏲᏢᏍᎦ.

source: Who put a handle on this hoe?
chr: ᎦᎪ ᎤᏭᎭᏝᏁᎢ ᎯᎠᎦᎶᎪᏗ.

source: Quail hunters sometimes accidentally shoot one another.
chr: ᎫᏇ ᏧᏂᎰᎯ ᏴᏓᎭ ᎤᏅᏌ ᏓᎾᏓᏲᏍᏙᏗᏍᎪᎢ.

source: When she finishes peeling potatoes, she washes them in water.
chr: ᏱᏚᏯᎨᏦᎿ ᎾᎾ ᎠᎼᎯ ᏕᎫᎯᎶᏍᎪᎢ.

source: She's accusing him of stealing apples.
chr: ᏒᎦᏔ ᏕᎦᏃᏍᎩᏍᎬ ᎫᎯᏍᏗᎭ.

source: How many lids do you want?
chr: ᎯᎳ ᎢᎦ ᏗᎫᏢᏗ ᏕᎦᏚᎵᎭ?

source: He covered his scar with his hand.
chr: ᎤᏬᏰᏂ ᎬᏗ ᎤᏭᏢᏅ ᎤᏁᎸᏒᎢ.

source: She boiled three eggs for breakfast.
chr: ᏦᎢᎭ ᏧᏪᏥ ᏚᏭᏅ ᏑᎾᎴ ᏧᏂᎩᏍᏗ.

source: Squirrels eat acorns.
chr: ᎫᎴ ᏓᏂᎩᏍᎪᎢ ᏌᎶᎵ.

source: I see a mourning dove flying.
chr: ᎫᎴ ᏗᏍᎪᏂ ᎦᏃᎯᎵᏒ ᏥᎪᏩᏘ.

source: The Muskogee fair is in the month of October.
chr: ᏚᏂᏂᏗ ᏓᎸ ᎨᏍ ᏣᎾᏓᏏᏍᎪᎢ ᎫᏐᎢ.

source: I've already asked someone to pick these rocks up.
chr: ᎦᏳᎳ ᎩᎶ ᏥᏅᏫᏍᏔᎾ ᏧᏭᏖᏍᏗ ᎯᎠ ᏅᏯ ᏔᏂᎳᎨᏯ.

source: It snowed on Christmas day.
chr: ᏓᏂᏍᏓᏲᎯᎲ ᎢᎦ ᎤᏭᏔᏅᎢ.

source: He raises watermelons every summer.
chr: ᎪᎩ ᏂᏕᎦᎵᏍᏔᏂᏒ ᎬᎩᏍᏗ ᏓᏛᎯᏍᏗᏍᎪᎢ.

source: Mother is sifting flour.
chr: ᎢᏌ ᎬᎫᏍᏗᎭ ᎡᏥ.

source: The roof on the house leaks when it rains.
chr: ᎦᎵᏦᏕ ᎦᎵᏦᏛ ᎬᎪᏍᎪ ᏳᎦᎿᎾ.

source: He hit the nail with a hammer. She conversed by means of Cherokee.
chr: ᎦᏅᏆᎶᏍᏗ ᎬᏗ ᎤᏩᏂᎸ ᏴᎩ. ᏣᎳᎩ ᎬᏗ ᏚᎵᏃᎮᏢᎢ

source: I heard a bobcat last night.
chr: ᎬᎮ ᏂᎦᏪᏍᎬ ᎠᏆᏛᎦᏅ ᎤᏒᎢ ᏥᎨᏒᎢ.

source: They say he is barely alive.
chr: ᎤᏎᎦᏨ ᎬᎿ ᎠᎾᏗᎭ.

source: He has a very active family.
chr: ᏙᎯᏳ ᏗᏅᎿᎦᎵᏍᏗ ᏚᏓᏘᎾᎠ.

source: I have a black car.
chr: ᎬᎿᎨ ᏓᏆᎴᎳ ᎠᏆᎴᎳ ᎠᎩᎭ.

source: The batter hit the ball hard. Someone is knocking at the door.
chr: ᎪᏍᏛᏂᎯ ᏍᏓᏱ ᎤᏩᏂᎸ ᏍᏆᏞᏍᏗ. ᎩᎶ ᎬᏂᎭ ᎦᎶᎯᏍᏗᎢ.

source: What do you have cooking?
chr: ᎦᏙ ᎤᏍᏗ ᏨᏂᏍᏗ?

source: Is that snake lying there alive?
chr: ᎬᏃᏓᏍ Ꮎ ᎢᎾᏓ ᏥᎦᎾ?

source: The murderer was sentenced to life imprisonment.
chr: Ꮎ ᎠᏍᎦᏯ ᏴᏫ ᎤᏢᎢ ᎬᏅᎢ ᎢᎪᎯᏓ ᎠᏥᏍᏚᏗ ᏚᏚᎪᏓᏏ.

source: He got choked trying to swallow something whole.
chr: ᎪᎱᏍᏗ ᎬᏩᏃᏍᏓ ᎤᎩᎯᏍᏗ ᎠᏁᎵᏗᏍᎬ ᎤᏴᏥᏅᏨᎢ.

source: He likes fried potatoes.
chr: ᏄᎾ ᏗᎬᏣᏝᏅ ᏚᎸᏉᏗ.

source: What are you frying?
chr: ᎦᏙ ᎤᏍᏗ ᎲᏣᎸᏍᎦ?

source: How many turkeys do you own?
chr: ᎯᎳ ᎢᏯᏂᎢ ᎬᎾ ᏕᎯᎾᏝᎠ?

source: When the sunshine melted the snow, it became muddy.
chr: ᎠᎦᎵᏍᎬ ᎤᏩᏃᏬᏔᎾ ᎤᏅᏥ, ᏝᏬᏚᎯ ᏄᎵᏍᏔᏅᎢ.

source: A glass made of plastic melted when she put it in some hot water.
chr: ᎬᎾᏬᏍᎩ ᎪᏢᏔᏅ ᎤᎸᏌᏗ ᎤᏩᎾᏬᏒ ᎤᏗᏞᎩ ᎠᎹ ᎠᏟᏍᏛ ᏭᏝᎾ.

source: Where is the broom?
chr: ᎭᏢ ᏥᏯ ᎬᏃᏌᏍᏗ?

source: Sweep the floor before you go.
chr: ᏯᏖᏃ ᎲᏃᏌᎲᎢ ᏂᏣᏂᎩᏓᏊ.

source: When do blackberries get ripe?
chr: ᎯᎳ ᎢᏴ ᎬᏂᏍᎪ ᎧᏄᎦᏟ?

source: He is hiding a stolen car.
chr: ᏓᏆᎴᎳ ᎦᏃᏍᎩᏓ ᎬᏍᎦᏢᏍᎦ.

source: Someone is coming. Hide the gun.
chr: ᎩᎶ ᏓᏯᎢ. ᎲᏍᎦᎳᏓ ᎦᎶᏇ.

source: He hid his shirt in a drawer.
chr: ᏗᏎᎯᏍᏗ ᎤᏩᏍᎦᎸᏅ ᎤᎿᏬ.

source: He cracked a bucket full of hickory nuts.
chr: ᎤᎵᏣᏗ ᎧᎵ ᏚᏩᏍᏆᎶᎥ ᏐᎯ.

source: He doesn't know how much coal to put into the fire.
chr: Ꮭ ᏳᏅᏔ ᎢᎦ ᎤᏮᏘᏗ ᏥᏃᏍᎦ.

source: How long did you soak the clothes?
chr: ᎯᎳ ᎢᎪᎯᏓ ᏕᏨᏩᎳᏁ ᏗᎿᏬ?

source: Soldiers were all around.
chr: ᎬᏩᏚᏫᏓ ᏄᎾᏛᏅ ᎠᏂᏲᏍᎩ.

source: Where did your friend go?
chr: ᎭᏢ ᏫᎦᎶᎯ ᏍᏓᎵᎢ?

source: I can stay under water for two minutes.
chr: ᎡᎵᏊ ᏔᎵ ᎢᏯᏔᏬᏍᏔᏅ ᏱᎨᏓ ᎠᎹᏱ ᎭᏫᏂ.

source: The cat is lying underneath the chair.
chr: ᎦᏍᎩᎸ ᎭᏫᏂ ᏗᏜ ᎦᏅᎦ ᏪᏌ.

source: Meat is less expensive at slaughter houses.
chr: ᏏᏆ ᏧᏂᎯᏍᏗ ᎦᏲᏟᎨ ᏓᎬᏩᎶᏙ ᎭᏫᏯ.

source: Don't be doing that.
chr: ᏞᏍᏗ ᎥᏍᎩ ᏱᎿᏛᏁᎮᏍᏗ.

source: These are my children.
chr: ᎯᎠ ᏗᏇᏥ.

source: How much does it cost?
chr: ᎯᎳ ᎢᎦ ᏧᎬᏩᎶᏗ?

source: When do you want me to come and visit you?
chr: ᎯᎳᏴ ᏫᎬᏩᏛᎯᏓᏍᏗ ᏣᏚᎵᎭ?

source: I have a total of five cows.
chr: ᎯᏍᎩ ᎾᏂᎠ ᏩᎦ ᏕᏥᎾᏝᎠ.

source: Are you hungry? No.
chr: ᏣᏲᏏᎭᏍ? Ꮭ.

source: What were you saying? Nothing.
chr: ᎦᏙᎩ ᎭᏗᏍᎨ? Ꮭ ᎪᎱᏍᏗ.

source: I am going nowhere today.
chr: Ꮭ ᎢᎸᏢ ᏱᏓᎨᏏ ᎪᎯ ᎢᎦ.

source: Some people have never been in jail.
chr: ᎢᎦᏓ ᏴᏫ Ꮭ ᎢᎸᎯᏳ ᏧᎾᏓᏍᏚᏗ ᏱᎨᏐᎢ.

source: I see no one that I know.
chr: Ꮭ ᎩᎶ ᏱᏥᎪᏩᏘ ᏥᏲᎵᎩ.

source: He doctored himself where a wasp stung him by rubbing mud on it.
chr: ᏝᏬᏚ ᎤᏅᎵᏰᎥ ᎠᏅᏫᏍᎬ ᎧᎾᏥᏍᏕᏥ ᎤᏩᏨᏴᎢ.

source: He's washing a muddy car.
chr: ᏝᏬᏚ ᏓᏆᎴᎳ ᎦᏅᎦᎵᎭ.

source: She fell in the mud when she slipped.
chr: ᏳᎦᎿᎾ, ᏝᏬᏚᎯ ᏂᏁᏕᎦᎵᏗᏍᎪ ᏕᎦᏅᏅᎢ.

source: Come here a while.
chr: ᎡᎮᎾ ᏞᎦ.

source: Did he say he was coming soon?
chr: ᏞᎩᏍ ᏓᎦᎷᏥ ᎤᏛᏁ?

source: Don't be mean.
chr: ᏞᏍᏗ ᏱᏣᏁᎫᏤᏍᏗ.

source: Cut down all the dead trees.
chr: ᏧᏪᏘ ᏕᏢᎬ ᏂᎦᏓ ᏕᏥᎴᏴᏍᏔᏅᎢ.

source: He's feeding a mountain lion .
chr: ᎣᏓᎸ ᎡᎯ ᏢᏓᏥ ᎨᏠᎭ.

source: Inadawouga. Howa.
chr: ᎢᎾᏓᏬᎤᎦ. ᎰᏩ.

source: What are you going to use those boards for?
chr: ᎦᏙ ᏙᏛᏔᏂ Ꮎ ᏧᏯᏖᎾ?

source: You go through a narrow gate when you're going to his house.
chr: ᏯᏙᏟ ᏍᏚᏗ ᎬᏙᎥ ᏫᎦᎶᎯᏍᏗ ᏧᏪᏅᏒ ᏲᎦ.

source: My mother is always sewing quilts.
chr: ᏂᎪᎯᎸ ᏗᏰᎦᏟ ᏕᎦᏰᏫᏍᎪ ᎡᏥ.

source: How many do you want?
chr: ᎯᎳ ᎢᎦ ᏕᏣᏚᎵᎭ?

source: If it isn't night, it's day.
chr: ᎤᏒ ᏂᎨᏒᎾ ᏱᎩ ᎢᎦ ᎨᏐᎢ.

source: Some of the ball players didn't come.
chr: ᎢᎦᏓ ᎠᎾᎳᏍᎦᎵᏍᎩ Ꮭ ᏳᏂᎷᏤᎢ.

source: He's just returning from fishing.
chr: ᎩᎳᏛ ᎢᎦᎷᎦ ᎤᏑᏂᏙᎸᎢ.

source: He used a rope fifty feet long in roping a calf.
chr: ᎯᎩᏍᎪ ᎢᎳᏏᏗ ᎢᎦᏅᎯᏓ ᏍᏕᏱᏓ ᎤᏮᏔᏅ ᏩᎦ ᎠᎩᎾ ᎠᏍᎳᏗᏍᎬᎢ.

source: I want to buy three ricks of wood.
chr: ᏦᎢ ᎢᎦᏒᏘ ᎠᏓ ᏗᎩᏩᎯᏍᏗ ᎠᏆᏚᎵᎭ.

source: That ballplayer is six feet, six inches tall.
chr: ᏑᏓᎵ ᎢᎳᏏᏗ, ᏑᏓᎵ ᎢᏏᏔᏗᏍᏗ ᎢᎦᏘ Ꮎ ᎠᎳᏍᎦᎵᏍᎩ.

source: How long did it take?
chr: ᎯᎳ ᎢᎪᎯᏓ ᎤᏟᎢᎵᏙᎴ?

source: I stayed there until they adjourned.
chr: ᏫᏓᏂᏰᎵᏍᎬ ᎢᎪᎯᏓ ᏩᏇᏙᎸᎢ.

source: He has corn planted in an area of one hundred acres.
chr: ᏍᎪᎯᏥᏆ ᎢᏳᏟᎶᏓ ᎢᎬᎾᏕᎾ ᏚᏫᏌ ᏎᎷ.

source: Did you get here before I did?
chr: ᎢᎬᏱᏍ ᎯᎷᎩ ᏏᏅ ᎠᏴ ᎨᏒ?

source: This man is the first speaker.
chr: ᎯᎠ ᎠᏍᎦᏯ ᎢᎬᏱ ᎦᏬᏂᏍᎩ.

source: Let's go pick some green beans.
chr: ᎠᏂᏤ ᏚᏯ ᏗᎾᏕᏑᎦ.

source: He used to have an old car, but now he has a new one.
chr: ᎤᏪᏘ ᏓᏆᎴᎳ ᏧᎲ ᎠᏎᏅ ᏃᏊ ᎢᏤ ᎤᎭ.

source: A friend of mine lives in a green house.
chr: ᎢᏤᎢᏳᏍᏗ ᎠᏓᏁᎸ ᎦᏁᎳ ᎣᎩᎾᎵᎢ.

source: How many years was he gone?
chr: ᎯᎳ ᎢᏧᏕᏘᏴᏓ ᎤᏁᎳᏕᎢ?

source: Both of you work tomorrow.
chr: ᎢᏧᎳ ᏕᏍᏗᎸᏫᏍᏓᏁᎸ ᏑᎾᎴᎢ.

source: What size hat do you wear?
chr: ᎯᎳ ᎢᎩᏓ ᎠᎵᏍᏇᏚᏬ ᎭᎵᏍᏇᏚᎲᏍᎩ?

source: His boat is ten feet long.
chr: ᏍᎪᎯ ᎢᎳᏏᏗ ᏂᎦᏅᎭ ᏥᏳ ᎤᏤᎵᎢ.

source: Have you ever been bitten by a snake?
chr: ᎢᎸᎯᏳᎢᏍ ᎢᎾᏓ ᏣᎦᏟᏨᎢ?

source: He walked a few miles before he caught a ride.
chr: ᎢᎸᏍᎩ ᎢᏳᏟᎶᏓ ᎡᎳᏗ ᎤᏂᎩᏒᎢ ᎩᎳ ᎤᏓᏣᏁᎸᎢ.

source: When I was in the military service, I went away.
chr: ᎠᏂᏲᏍᎩ ᏥᏥᏯᎥ ᎢᎾ ᏩᏇᏙᎸᎢ.

source: Which snake is the most dangerous?
chr: ᎦᏙ ᎤᏍᏗ ᎢᎾᏓ ᏫᎦᎾᏰᎬᎢ?

source: The lion went back into the wilderness when it escaped.
chr: ᎢᎾᎨ ᏮᎤᎶᏒ ᏢᏓᏥ ᎤᎵᏘᏌ.

source: He's too far away to hear you.
chr: ᎢᏅᎯ ᏪᏙᎭ ᏣᏛᎪᏗᎢ.

source: Go get some flour downtown.
chr: ᎢᏌ ᏫᎩ ᏗᎦᏚᎲ.

source: Twelve inches make one foot.
chr: ᏔᎵᏚ ᎢᏏᏔᏗᏍᏗ ᏌᏊ ᎢᎳᏏᏗ ᏂᎦᎵᏍᏗᏍᎪᎢ.

source: Do you like pie made of pumpkin?
chr: ᏣᎸᏉᏗᏍ ᎢᏯ ᎪᏢᏔᏅ ᎨᎵᏍᏗᎩ?

source: I want a fifteen-cent drink.
chr: ᏍᎩᎦᏚ ᎢᏯᏓᏅᏖᏗ ᏧᎬᏩᎶᏗ ᎠᏗᏔᏍᏗ ᎠᏆᏚᎵᎭ.

source: Three thousand people came to hear the President speak.
chr: ᏦᎢ ᎢᏯᎦᏴᎵ ᎢᏯᏂ ᏴᏫ ᎤᎾᏛᏓᏍᎠᏂᏢ ᎤᎬᏫᏳᎯ ᎦᏬᏂᏍᎬᎢ.

source: It's ten minutes past four.
chr: ᏍᎪᎯ ᎢᏯᏔᏬᏍᏔᏅ ᎤᎶᏒᏍᏗ ᏅᎩ.

source: How far apart do you plant your corn? How often does he visit you?
chr: ᎯᎳ ᎢᏳᏓᎵ ᏕᎯᏫᏍᎪ ᏎᎷ? ᎯᎳ ᎢᏳᏓᎵ ᏣᏩᏛᏂᏙᎰᎢ?

source: He carried two gallons of blackberries for three miles.
chr: ᏦᎢ ᎢᏳᏟᎶᏓ ᎢᏳᏓᏅᎯᏓ ᎤᏫᏛᎲ ᏔᎵ ᎢᏳᏟᎶᏓ ᎧᏄᎦᏟ.

source: She used crutches for three weeks.
chr: ᏦᎢ ᎢᏳᎾᏙᏓᏆᏍᏗ ᎢᎪᎯᏓ ᏗᏙᎳᏅᏍᏗ ᏚᏮᏔᏅᎢ.

source: I want one like it.
chr: ᎥᏍᎩ ᎢᏳᏍᏗ ᎠᏆᏚᎵᎭ.

source: He stopped by at twelve o'clock.
chr: ᏔᎵᏚ ᎢᏳᏩᏂᎸ ᏥᎨᏒ ᏧᎶᎯᏍᏔᏅᎢ.

source: How many times have you gone swimming?
chr: ᎯᎳ ᎢᏳᏩᎪᏗ ᎢᏣᏓᏬᏓ ᎪᎯ ᎪᎩ?

source: Do you speak Cherokee?
chr: ᏣᎳᎩᏍ ᎯᏬᏂᏍᎩ?

source: How many Cherokees work at the Cherokee Nation?
chr: ᎯᎳ ᎾᏂᎠ ᎠᏂᏣᎳᎩ ᏚᏂᎸᏫᏍᏓᏁ ᏣᎳᎩ ᎠᏰᎵᎢ?

source: There are tall mountains in North Carolina.
chr: ᏣᎳᎫᏪᏘ ᎢᎾ ᎢᏗᎦᏘ ᏙᏓᎳ.

source: When a chickadee sings near a house, Cherokees say that someone will come.
chr: ᏥᎩᎵᎵ ᏱᏂᎦᏪ ᎠᏓᏁᎸ ᎾᎥ, ᎩᎶ ᏓᎦᎷᏥ ᎠᎾᏗᏍᎪ ᎠᏂᏣᎳᎩ.

source: Get one package of chewing gum, okay?
chr: ᏌᏊ ᏂᏕᎦᎳᏗᏍᏛ ᏥᎳᎵ ᏕᎯᏴᎲᎢ, ᎰᏩᏧ?

source: Have you ever heard about Jesus?
chr: ᎢᎸᎯᏳᎢᏍ ᎯᏯᏍᎩᏨ ᏥᏌ?

source: My brother likes to hunt rabbits.
chr: ᏦᏍᏓᏓᏅᏟ ᎤᎸᏉᏗ ᏥᏍᏚ ᏧᏲᏍᏗᎢ.

source: Let's go hunt crawdads.
chr: ᏥᏍᏛᎾ ᏗᎩᏯᎷᎦ.

source: A scorpion stung him on his foot.
chr: ᏥᏍᏛᎾ ᎠᏓᏧᏯᏍᎩ ᎤᏩᏨᏴ ᎤᎳᏍᎢᏕᏂ.

source: Some birds migrate south in the winter.
chr: ᎢᎦᏓ ᏥᏍᏆ ᏧᎦᏃᏮ ᏩᏂᎶᏍᎪ ᎪᎳ ᏱᏄᎵᏍᏓᎾ.

source: A robin has a red breast.
chr: ᏥᏍᏉᏉ ᎩᎦᎨ ᎨᏐ ᎦᏁᏥᎢ.

source: He likes to eat fried chicken.
chr: ᏥᏔᎦ ᎬᏣᏝᎾ ᎤᎸᏉᏗ ᎤᎩᏍᏗ.

source: A rooster is sitting on a post crowing.
chr: ᎨᏛ ᎤᎩᎳ ᏥᏔᎦ ᎠᏨᎦ ᎠᏴᎦ.

source: I see an airplane.
chr: ᏥᏳ ᎠᏝᏫᏗᏍᎩ ᏥᎪᏩᏘᎭ.

source: Which man is the pilot?
chr: ᎦᏙ ᎤᏍᏗ ᎠᏍᎦᏯ ᏥᏳ ᏗᏝᏫᏘᏗᏍᎩ?

source: Go straight ahead.
chr: ᏥᏳᎪᏗ ᏫᎶᎯ.

source: Let's go upstream.
chr: ᏦᎩ ᏗᏜ ᎢᏁᎾ.

source: I'm going to Texas for three days.
chr: ᏥᎢ ᏧᏒᎯᏓ ᏫᏓᎨᏙᎵ ᏅᏓᎩ.

source: Turn to the third page.
chr: ᏦᎢᏁ ᎤᎦᏅᏓᏛ ᏫᏴᏈᏓᎩ.

source: He's been gone since Wednesday.
chr: ᏦᎢᏁ ᎢᎦ ᏥᎨᏒ ᎬᏩᏂᎩᏓ.

source: Long ago the Cherokees raised tobacco.
chr: ᎪᎯᎩ ᏥᎨᏒ ᏦᎳ ᎠᎾᏛᎯᏍᏗᏍᎬ ᎠᏂᏣᎳᎩ.

source: If the windows happen to be open, close them.
chr: ᏗᏍᏚᎢᏓ ᎢᎨᏎᏍᏗ ᏦᎳᏂ, ᏕᎯᏍᏚᏅᎢ.

source: They have various things on sale.
chr: ᏧᏓᎴᏅᏓ ᎤᏂᏍᎪᎵᏗᏓᎾ.

source: Who is the chairman of your group?
chr: ᎦᎪ ᏧᏓᏘᎿᎢ ᎢᏣᏓᎷᎬᎢ?

source: Geese head south when winter comes.
chr: ᏧᎦᏅᏮ ᏗᏜ ᏓᏄᎪᏗᏍᎪ ᏌᏌ ᎪᎳ ᏱᏄᎵᏍᏔᎾ.

source: The farmer is planting cabbage.
chr: Ꮎ ᏗᎦᎶᎩᏍᎩ ᏧᎦᎾᏕᎾ ᎠᏫᏍᎦ.

source: Are you afraid of centipedes?
chr: ᎦᎯᏍᎦᎰᏍ ᏧᏂᎦᏃᏥ?

source: If the price is too high, I'm not going to buy the car.
chr: ᎦᎸᎳᏗ ᏧᎬᏩᎶᏗ ᎢᎨᏎᏍᏗ, Ꮭ ᏱᏛᎩᏩᏏ ᏓᏆᎴᎳ

source: Wealth does not cause happiness.
chr: Ꮭ ᏧᎬᏩᎶᏗ ᏱᏂᎬᎯᏏᏍᎪ ᎠᎴᎮᎵᏍᏗ ᎨᏒᎢ.

source: In the past there weren't as many storms.
chr: ᏧᏟᎢᎸᏍᏔᏅ Ꮭ ᎥᏍᎩ ᎢᎦ ᏱᏗᎦᏃᎸᏍᎨᎢ.

source: If milk is left out in the heat too long, it becomes sour.
chr: ᎪᎯᏗ ᎤᏗᏞᎬ ᏱᎦᏁ ᎤᏅᏗ, ᏧᎿᏦᏍᏗ ᏂᎦᎵᏍᏗᏍᎪᎢ.

source: The boy's clothes are being washed for him.
chr: ᏧᎿᏬ ᏓᎬᎩᎶᎡᎭ ᎠᏧᏣ.

source: The wind is from the north.
chr: ᏧᏴᏢᎢ ᏗᏜ ᏧᎦᏘ ᎦᏃᎸᏍᎬᎢ.

source: He's putting up barbed wire fence around the pasture.
chr: ᏧᏣᏲᏍᏗ ᎤᏯᏅ ᎠᏏᎳᏛᏍᎦ ᏠᎨᏒ.

source: His friend became a bullfighter.
chr: ᏩᎦ ᏧᎧᏅᏍᏕᎾ ᏗᎵᏍᏗᏍᎩ ᏄᎵᏍᏔᏅ ᎤᎾᎵᎢ.

source: Is it smoky because of grass fires?
chr: ᏕᎦᎵᎦᏍ ᏂᎦ ᏧᏒᏍᏗ ᏥᎩ?

source: They say he was asphyxiated by smoke.
chr: ᏧᎦᏒᏍᏗ ᎤᎭᏴᎴ ᎠᎾᏗᎭ.

source: I almost stepped on a copperhead.
chr: ᎠᎴ ᏧᎦᏔᏥᏍᏓᏟ ᏂᏥᏯᎳᏍᏛᏓ.

source: The sunshine is very blinding.
chr: ᎤᏙᎯᏳ ᏧᎦᏙᏴᎢᏍᏗ ᎠᎦᎵᎭ.

source: This man was bitten by an alligator.
chr: ᏧᎳᏍᎩ ᎤᏍᎦᎵᏨ ᎯᎠ ᎠᏍᎦᏯ.

source: My mother has an old cast iron pot.
chr: ᎤᏪᏘ ᏧᎳᏍᎩ ᎤᎭ ᎡᏥ.

source: If he was brave, he wouldn't have run away.
chr: ᏧᎵᏨᏯᏍᏗ ᏱᎨᏎ, Ꮭ ᎯᎬᏩᎵᏘᏎᎢ.

source: He talks to deaf people in sign language.
chr: ᏧᏬᏰᏂ ᎬᏗ, ᏓᏟᏃᎮᏗᏍᎪ ᏧᏂᎵᎡᎾ ᏴᏫ.

source: He likes to fish for catfish.
chr: ᏧᏂᎵᏍᏓᎾᎵ ᏧᏑᏗ ᎤᎸᏉᏗ.

source: Where did you put my striped shirt?
chr: ᎭᏢ ᏣᏅᏁ Ꮎ ᏧᎶᎸᏗ ᎠᏆᎿᏬ?

source: Do you work nightly?
chr: ᏧᎵᏏᏅᏓᏍ ᏕᏣᎸᏫᏍᏓᏁᎰᎢ?

source: The workers are on a noon break.
chr: ᎢᎦ ᎤᏂᏲᎯᏍᏗ ᏧᏂᎸᏫᏍᏓᏁᎯ.

source: They are going to build a new jail.
chr: ᎢᏤ ᏧᎾᏓᏍᏚᏗ ᏛᎾᏁᏍᎨᎯ.

source: Which school did you attend?
chr: ᎦᏙ ᎤᏍᏗ ᏧᎾᏕᏠᏆᏍᏗ ᏕᏣᏕᏠᏆᎡᎢ?

source: My friend is employed at a restaurant.
chr: ᏧᎾᎵᏍᏓᏴᏗ ᎠᏥᎾᏝᎠ ᎣᎩᎾᎵᎢ.

source: She does her laundry on Fridays.
chr: ᏧᏅᎩᎶᏍᏗ ᎢᎦ ᏕᎬᎩᎶᏍᎪᎢ.

source: How long were you in the hospital?
chr: ᎯᎳ ᎢᎪᎯᏓ ᏫᏅᎨᎢ ᏧᏂᏢᎩᎢ?

source: In the year 1974, the Cherokees built a new motel near Tahlequah.
chr: ᏐᏁᎳᏚ ᎢᏍᎪᎯᏥᏆ ᎦᎵᏆᏍᎪ ᏅᎩ ᎤᏕᏘᏴᏌᏗᏒ ᎢᏤ ᏧᏂᏒᏍᏗ ᎤᎾᏁᏍᎨᎲ ᎠᏂᏣᎳᎩ ᏓliᏆ ᏅᎥᎢ.

source: He went on a vacation for ten days.
chr: ᏍᎪᎯ ᏧᏒᎯᏓ Ꮩ ᎤᏪᏙᎸ ᏚᎸᏫᏍᏓᏁᎲᎢ.

source: I am going to my friend's house.
chr: ᎣᎩᎾᎵᎢ ᏧᏪᏅᏒ ᏫᏓᎨᏙᎵ.

source: Is Satan from hell?
chr: ᏨᏍᎩᏃᎢᏍ ᎡᎯ ᏎᏓᏂ?

source: Groundhog day is in the month of February.
chr: ᎧᎦᎵ ᎧᎸ ᎤᏅᎪᎢᏍᏗ ᎨᏐᎢ.

source: I like strong coffee.
chr: ᎤᏴᏍᏗ ᎧᏫ ᎠᎩᎸᏉᏗ.

source: The bucket is full of water.
chr: ᎠᎹ ᎧᎵ ᎠᏟᏍᏗ ᏒᏙᏂ.

source: Locusts make good posts.
chr: ᎧᎶᏇᎩᏗ ᏦᏍᏓ ᏗᎨᏛᏍᏗ ᏓᏙᏢᏍᎪᎢ.

source: I grew up close to Locust Grove.
chr: ᎧᎶᏇᎩᏗ ᎾᎥ ᎠᏆᏛᏒᎢ.

source: She bought sugar to make candy.
chr: ᎧᏎᏥ ᎤᏩᎯ ᎧᏎᏥ ᏧᏬᏢᏙᏗ.

source: What month is your birthday?
chr: ᎦᏙ ᎤᏍᏗ ᎧᎸ ᏣᏕᏘᏱᏍᎩ?

source: There's a butterfly on your shirt.
chr: ᎧᎹᎹ ᎤᎩᎳ ᏣᏄᏮᎢ.

source: They're hunting wild elephants.
chr: ᎧᎹᎹ ᎠᏁᏯᏔᎯ ᏚᏂᏲᎭ.

source: There are wasps flying around outside.
chr: ᎧᎾᏥᏍᏕᏥ ᎠᏂᏃᎯᎵᏙᎭ ᏙᏱ.

source: He barely ascended the mountain.
chr: ᎤᏎᎦᏨ ᎤᎿᎷᏒᎢ ᎣᏓᎸᎢ.

source: His car stalled going uphill.
chr: ᎧᎾᎷᏍᎬ ᎤᎴᏫᏍᏓᏁᎸ ᏓᏆᎴᎳ.

source: Put anger aside.
chr: Ᏼ ᏂᏨᎦ ᎧᎾᎸᎢᏍᏗ.

source: He angered the wasps by hitting them with rocks.
chr: ᏅᏯ ᎬᏗ ᏕᎬᎯᎲ ᏚᎿᎸᏍᏔᏅ ᎧᎾᏥᏍᏕᏥ.

source: A spider is making a web.
chr: ᎧᎾᏁᏍᎩ ᎧᏂᎳᏕᏫᏍᎦ.

source: He cut his little toe with an axe .
chr: ᎤᏍᏗ ᎧᎾᏌᏛ ᎤᏓᏴᏝᎸ ᎦᎷᏯᏍᏗ ᎬᏗ.

source: He's rooting out bushes.
chr: ᏕᎧᎾᏍᏕᏟᎭ ᏚᏩᎢᏢᎢ.

source: Bring a pick when you come.
chr: ᎧᎾᏍᏕᏢᏗ ᎯᏃᏢ ᎯᎷᏨᎢ.

source: I get cold when it's cold outside.
chr: ᏥᎾᏬᎪ ᏳᏴᏜ ᏙᎯ.

source: Did he answer when you were speaking to him, or not?
chr: ᎧᏁᎩᏍ ᏥᏯᎵᏃᎮᏗᏍᎬ, ᏝᎨ?

source: He pried the stump with a crowbar.
chr: ᎨᏘᎶᏍᏗ ᎬᏗ, ᎤᏁᏆᏛᎲ ᎤᏂᎷᎬᎢ.

source: He increased his work load when he finished school.
chr: ᎤᏁᏉᎥ ᏧᎸᏫᏍᏓᏁᏗ ᎤᏍᏆᏓ ᏓᏕᏠᏆᏍᎬᎢ.

source: The patient's fever is increasing.
chr: ᎤᏢᎩ ᎤᏗᏞᎲᏍᎬ ᎧᏁᏉᎦ.

source: I thought I mentioned it.
chr: ᏣᎩᎢᏁᎢᏍᏔᏅ ᎨᎵᏍᎬ.

source: I guess it's heating up because there's foreign matter in the water line.
chr: ᎠᎹᏛ ᎠᏎ ᎧᎾᏌᏝ ᏣᏖᏴᏍᎦ.

source: Who put foreign matter in the well?
chr: ᎦᎪ ᎤᏁᏌᏝᏁ ᎠᎹᏢᏗᎢ?

source: These boxes are empty.
chr: ᎯᎠ ᏗᎧᏁᏌᎢ ᏧᏏᏩ.

source: A young bird fell out of a nest.
chr: ᎧᏁᏍᏓᏝᎲ ᏓᎦᎶᎯ ᏥᏍᏆ ᎠᏓ.

source: In the summertime, the boys haul hay.
chr: ᎪᎩ ᏱᏄᎵᏍᏔᎾ, ᎧᏁᏍᎦ ᎠᏂᎾᏌᏁᏍᎪ ᎠᏂᏧᏣ.

source: She had surgery on her knee last May.
chr: ᎠᏂᏍᎬᏘ ᏥᎧᎸ ᎠᏥᏰᏝᎸ ᎧᏂᎨᏂ.

source: I'm going to collect from him what he owes me when I see him.
chr: ᏥᏚᎬ ᎢᎦ ᏓᏥᏂᏝᏂ ᏥᎪᎥᎢ.

source: What do you use to kill rats?
chr: ᎦᏙ ᎤᏍᏗ ᏕᎯᎯᏍᏗᏍᎪᎢ ᎧᏂᏈᏌ?

source: He's eating a chicken wing.
chr: ᏥᏔᎦ ᎧᏃᎨ ᎠᏍᏗᎩᎠ.

source: He broke his arm when he fell.
chr: ᎧᏃᎨᏂ ᎤᎵᏍᏆᎵᏎᎸ ᎤᏅᏣ.

source: The newscaster is telling the news. A preacher preached the gospel to the people.
chr: ᎧᏃᎮᏓ ᎧᏃᎮᏍᎩ ᎧᏃᎮᏓ ᎧᏃᎮᎭ. ᎠᎵᏣᏙᎲᏍᎩ ᎧᏃᎮᏓ ᏚᎵᏣᏙᏁᎸ ᏴᏫ.

source: Don't tell what happened.
chr: ᏞᏍᏗ ᏥᎯᏃᎮᏟ ᏄᎵᏍᏔᏂᏙᎸᎢ.

source: Did you omit him on purpose?
chr: ᎠᏎᎢᏍ ᎯᏃᎯᏰᎢ?

source: Cherokee Baptists eat Passover Supper every three months.
chr: ᏦᎢ ᎢᏯᏅᏓ ᎢᏳᏓᎵ ᎧᏃᎯᏰᎩ ᎠᎾᎵᏍᏓᏴᎲᏍᎪ ᎠᏂᏣᎳᎩ ᏗᎾᏓᏬᏍᎩ.

source: The mother is fanning her baby.
chr: ᎤᏍᏗ ᎤᏤᎵ ᎧᏃᏰᎭ ᎤᏓᏥᎢ.

source: Do you like to drink sassafrass tea?
chr: ᏣᎸᏉᏗᏍ ᎧᎾᏍᏓᏥ ᎠᎦᏅ ᏣᏗᏔᏍᏗ?

source: I want to pick blackberries.
chr: ᎧᏄᎦᏟ ᎠᏆᏕᏍᏗ ᎠᏆᏚᎵᎭ.

source: He's shooting bullfrogs with arrows.
chr: ᎦᏟᏓ ᎬᏗ ᏓᏲᎯᎭ ᎧᏄᎾ.

source: It was misting when I came in.
chr: ᎧᏄᏲᎳᏗᏍᎬᏛ ᏥᏓᏥᏴᎠ.

source: She strains sassafras tea with a cloth.
chr: ᎠᎿᏬ ᎬᏗ ᎧᏅᏐᎸᏍᏗᏍᎪ ᎧᎾᏍᏓᏥ ᎠᎦᏅᎢ.

source: Which room is the patient in?
chr: ᎦᏙ ᎤᏍᏗ ᎧᏅᏑᎸ ᎠᏯᎠ ᎤᏢᎩ?

source: A medicine man cured the boy's earache. A welder is welding a hole in a cast iron pot.
chr: ᏗᏓᏅᏫᏍᎩ ᎤᏅᏩᏅ ᎠᏧᏣ ᎦᎴᏂ ᎤᏪᏍᏓᏁᎲᎢ. ᏧᎳᏍᎩ ᎠᏔᎴᏍᏒ ᎧᏅᏫᎠ ᏔᎷᎩᏍᎩ ᏗᎧᏅᏫᏍᎩ.

source: I was born April second, nineteen hundred forty six.
chr: ᎧᏬᏂ ᏔᎵᏁ, ᏐᏁᎳᏚ ᎢᏍᎪᎯᏥᏆ ᏅᎩᏍᎪ ᏑᏓᎵ ᎠᏆᏕhᏁᎢ.

source: The boy is breathing hard because he ran a long distance.
chr: Ꮎ ᎠᏧᏣ ᎤᏓᏅᎯᏓ ᎤᏓᎾᏩᏍᏔᏅ ᎢᏳᏍᏗ ᏍᏓᏯ ᎧᏬᎳᏕᎠ.

source: Ducks like water.
chr: ᎧᏬᏄ ᎠᎹᏱ ᎤᏂᎸᏉᏗ.

source: His nose is peeling due to the hot sun.
chr: ᎧᏴᏐᎵ ᎠᏓᏁᎦᎵ ᎤᏗᏞᎩ ᎠᎦᎵᏍᎬ ᎢᏳᏍᏗ.

source: When did her husband part with her? I didn't know he was not living.
chr: ᎯᎳ ᎢᏴ ᏥᎨᏒ ᎤᏮᏕᏤ ᎠᏂᏁᎵ? Ꮭ ᏯᏆᏅᏖ ᏁᎲᎾ ᎨᏒᎢ.

source: I use a cane when I walk around.
chr: ᎠᏙᎳᏅᏍᏗ ᎬᏗᏍᎪ ᏯᏇᏙᎳ.

source: Put out the fire; it's too hot. The lightning put the lights out.
chr: ᎲᏜᏓ ᎪᏛᎢ; ᏙᏳ ᎤᏗᏞᎦ. ᏓᏨᏍᏛ ᏚᏮᎳᏛ ᎠᎾᎦᎵᏍᎩ.

source: Are you still sharpening the axe?
chr: ᏏᏍ ᎲᏟᎭ ᎦᎷᏯᏍᏗ?

source: When the wood burned up, the fire went out.
chr: ᏚᎪᏃᎿ ᎠᏓ ᎤᏮᏠᏒ ᎪᏛᎢ.

source: They always put paper into the the fire.
chr: ᏂᎪᎯᎸ ᏗᎪᏪᎵ ᏓᏅᏛᎥᏍᎪ ᎪᏛᎢ.

source: She likes to mingle with a lot of people.
chr: ᏥᏈᏍᏗ ᏴᏫ ᏄᎾᏛᎲ ᎤᏪᎳᏗᏓᏍᏗ ᎤᎸᏉᏗ.

source: My friend is a member of the Tahlequah police force.
chr: ᎣᎩᎾᎵᎢ ᏓᎵᏆ ᏗᎾᏓᏂᏱᏍᎩ ᎤᎾᏙᏢᏒᎢ ᎨᎵ.

source: He's sending his camel to bed.
chr: ᏗᎦᏂᏢ ᎦᏅᏍᎦ ᎤᏤᎵ ᎨᎻᎵ.

source: His chain broke but he linked it back together.
chr: ᎤᎾᏓᏕᏒᏓ ᏚᎵᎦᎵᏎᎸᎢ ᎠᏎᏅ ᏚᏫᏝᏅᎢ.

source: I will go to town later.
chr: ᎩᎳ ᏫᎨᏙᎸ ᏗᎦᏚᎲᎢ.

source: I went to sleep early last night. I have just closed the window.
chr: ᎩᎳ ᎤᏒ ᎠᎩᏢᏅ ᎤᏒ ᏥᎨᏒᎢ. ᎩᎳ ᏫᏥᏍᏚᎲᎦ ᏦᎳᏂ.

source: We'll get there pretty soon.
chr: ᎩᎳᏊ ᏫᏓᏗᎷᏥ.

source: When he was wounded, a doctor was there immediately.
chr: ᎠᏥᏐᏅᎿ ᎩᎳᏊ ᎢᏴᏓ ᎤᎷᏨ ᎠᎦᎾᎦᏘ.

source: Can someone tell me what's happening?
chr: ᎡᎵᏊᏍ ᎩᎶ ᏯᎩᏃᎯᏍ ᏂᎦᎵᏍᏔᏅᏍᎬ?

source: Chipmunks live in the woods.
chr: ᎢᎾᎨ ᎠᏁᎰ ᎩᏳᎦ.

source: When she took the sheet out of the dryer, she shook it.
chr: ᎦᏂᏟ ᎠᏰᏍᏛᏗ ᎤᎴᏌ ᏗᎧᏲᏗᏍᎩᎢ ᎤᏮᏣᎬᏅᎢ.

source: The Spades are my cousins.
chr: ᎠᏂᎪᏕᏍᎩ ᎪᎱᏍᏗ ᏗᏋᏂ.

source: Crows are corn thieves.
chr: ᎪᎦ ᏎᎷ ᏗᏂᏃᏍᎩᏍᎩ.

source: I saw him a while ago.
chr: ᎪᎯ ᏥᎨᏒ ᏥᏥᎪᎥ.

source: Wait for me. I'll be back after a while.
chr: ᏍᎩᎦᏘᏰᏍᏗ. ᎪᎯᏴ ᏛᏥᎷᏥ.

source: Dogs like to eat bones.
chr: ᎪᎳ ᏧᏂᏍᏗᎩᏍᏗ ᎤᏂᎸᏉᏗ ᎩᏟ.

source: Take the ashes out of the stove.
chr: ᎪᏍᏚ ᎯᎳᎩ ᏍᏏᎢ.

source: His pants became dusty when he fell.
chr: ᎪᏍᏚᎭ ᏄᎵᏍᏔᏅ ᎤᏑᎸ ᎤᏅᏣ.

source: Where does the dipper hang?
chr: ᎭᏢ ᎬᏙᎣ ᎠᎫᎩᏍᏗ?

source: When I returned from hunting, I hung up my gun.
chr: ᎠᎩᏃᎭᎵᏙᎸ ᎢᎠᎩᎷᏣ ᎠᏋᏙᏌᏛᎢ ᎦᎶᏇ.

source: Birds like to eat mulberries.
chr: ᏥᏍᏆ ᎤᏂᎸᏉᏗ ᎫᏩ ᎤᏂᎩᏍᏗᎢ.

source: Lighting struck a sycamore tree.
chr: ᎫᏩᏧᏁᎦ ᏡᎬ ᎤᏩᏂᎸ ᎠᎾᎦᎵᏍᎩ.

source: He sells a lot of huckleberries in the summer.
chr: ᎫᏩᏯ ᏥᏈᏍᏗ ᎦᎾᏕᎪᎢ ᎪᎩ ᏱᏄᎵᏍᏔᎾ.
